Lab 2 - Intro to pandas assignment - please if you wish to add more cells , you can do so from the menu tab 'Insert' or for a keyboard shortcut switch to command mode when you are on a cell by pressing Esc(The cell would then be labeled Blue on the side) and pressing b to insert a cell below.

Task 1 - Import pandas , and load the csv file and store as dataframe. - The dataset is IMDB's movie dataset.Link of the dataset - https://raw.githubusercontent.com/laxmimerit/All-CSV-ML-Data-Files-Download/master/IMDB-Movie-Data.csv

In [20]:
import pandas as pd
my_data = pd.read_csv('IMDB-Movie-Data.csv')
df=pd.DataFrame(my_data)

Task 2 - print out the first 7 rows and the last 3 rows

In [37]:
df.head(1)

,Rank,Title,Genre,Description,Director,Actors,Year,Runtime (Minutes),Rating,Votes,Revenue (Millions),Metascore
0,1,Guardians of the Galaxy,"Action,Adventure,Sci-Fi",A group of intergalactic criminals are forced ...,James Gunn,"Chris Pratt, Vin Diesel, Bradley Cooper, Zoe S...",2014,121,8.1,757074,333.13,76.0

In [38]:
df.tail(1)

,Rank,Title,Genre,Description,Director,Actors,Year,Runtime (Minutes),Rating,Votes,Revenue (Millions),Metascore
999,1000,Nine Lives,"Comedy,Family,Fantasy",A stuffy businessman finds himself trapped ins...,Barry Sonnenfeld,"Kevin Spacey, Jennifer Garner, Robbie Amell,Ch...",2016,87,5.3,12435,19.64,11.0

Task 3 - Print out the number of duplicated rows(how many duplicates), and remove them if there is any.

In [39]:
df.duplicated().sum()
#my_data.drop_duplicates(inplace = True) there are no duplicates so no need for this command

0

Task 4 - Extract the name of the feature with the most null entries and it print out.

In [40]:
df.count().idxmin()

'Revenue (Millions)'

Task 5 - Print out the number of null entries(how many rows contain a null value), and remove them if there is any.

In [41]:
df.isnull().sum()

Rank                    0
Title                   0
Genre                   0
Description             0
Director                0
Actors                  0
Year                    0
Runtime (Minutes)       0
Rating                  0
Votes                   0
Revenue (Millions)    128
Metascore              64
dtype: int64

In [42]:
df_without_null=df.dropna()

In [43]:
df_without_null.isnull().sum()

Rank                  0
Title                 0
Genre                 0
Description           0
Director              0
Actors                0
Year                  0
Runtime (Minutes)     0
Rating                0
Votes                 0
Revenue (Millions)    0
Metascore             0
dtype: int64

Task 6 - set the index of the dataframe to be the Movies feature.

In [44]:
df_without_null.set_index(['Title'],inplace = True)

Task 7 - Clean up the column names<br>
7i - Print out all column names<br>
7ii- Rename column names which contain spaces and remove them<br>
7iii - Convert all column names to lowercase<br>

In [45]:
print(df_without_null.columns.tolist())

['Rank', 'Genre', 'Description', 'Director', 'Actors', 'Year', 'Runtime (Minutes)', 'Rating', 'Votes', 'Revenue (Millions)', 'Metascore']

In [46]:
df_without_null.columns = df_without_null.columns.str.replace(' ', '_')

In [47]:
df_without_null.columns = df_without_null.columns.str.lower()

Task 8 Accessing rows<br> - Print out the 659th row<br>Print out the the rows from 330 to 350<br> Print out the row of the Movie named 'The Martian'.

In [48]:
df_without_null.iloc[659]

rank                                                                770
genre                                                             Drama
description           Life for the residents of a tower block begins...
director                                                   Ben Wheatley
actors                Tom Hiddleston, Jeremy Irons, Sienna Miller, L...
year                                                               2015
runtime_(minutes)                                                   119
rating                                                              5.7
votes                                                             25928
revenue_(millions)                                                 0.34
metascore                                                          65.0
Name: High-Rise, dtype: object

In [49]:
df_without_null.iloc[330:332]

,rank,genre,description,director,actors,year,runtime_(minutes),rating,votes,revenue_(millions),metascore
Title,,,,,,,,,,,
Sleight,371,"Action,Drama,Sci-Fi",A young street magician (Jacob Latimore) is le...,J.D. Dillard,"Jacob Latimore, Seychelle Gabriel, Dulé Hill, ...",2016,89,6.0,702,3.85,62.0
The Maze Runner,372,"Action,Mystery,Sci-Fi",Thomas is deposited in a community of boys aft...,Wes Ball,"Dylan O'Brien, Kaya Scodelario, Will Poulter, ...",2014,113,6.8,335531,102.41,57.0

In [50]:
df_without_null.loc['The Martian']

rank                                                                103
genre                                            Adventure,Drama,Sci-Fi
description           An astronaut becomes stranded on Mars after hi...
director                                                   Ridley Scott
actors                Matt Damon, Jessica Chastain, Kristen Wiig, Ka...
year                                                               2015
runtime_(minutes)                                                   144
rating                                                              8.0
votes                                                            556097
revenue_(millions)                                               228.43
metascore                                                          80.0
Name: The Martian, dtype: object

Task 9 - Create a new function which should take a genre as an input , detect wether there are multiple genres and return True if there is , False if there is not.
Create a new Column named multi_genre and apply the above function to fill it.

In [51]:
def genre_check(genre):
    if ',' in genre :
        return True
    else:
        return False

In [52]:
df_without_null=df_without_null.copy()
df_without_null['multi_genre']=df_without_null['genre'].apply(genre_check)

Task 10 - Write back your dataframe to a new csv file.

In [53]:
df_without_null.to_csv('modified_data.csv')